Repository: share-extras/langpack-cy
Catalog: tmx/repository.tmx
Source language: en_us
Languages: cy

source: NodeRef of the web project the deploy is occurring from.
cy: NodeRef o'r cywaith gwe mae'r darpariaeth yn dod o.

source: Modified Date
cy: Dyddiad Newid

source: The email templates folder was successfully created: {0}
cy: Wedi creu'r ffolder templedi e-bost yn llwyddiannus: {0}

source: Schema validation failed
cy: Methwyd dilysiant sgema

source: ''{0}'' has been denied access to ''{1}''.
cy: Mae "{0}" wedi cael ei gwrthod cychiad i "{1}".

source: Reindexed user:user and cm:person uids as identifiers
cy: Wedi ail-fynegeio uids usr:user a cm:person fel dynodyddion

source: The context within which this task has been assigned
cy: Y cud-destun sydd wedi ei neilltuo i'r tasg yma

source: The schema upgrade script, ''{0}'', has not been run against this database.
cy: Nid yw'r sgript uwchraddio sgema, "{0}", wedi rhedeg yn erbyn y cronfa ddata yma.

source: Fixes names ending with a space or full stop.
cy: Trwsio enwau sy'n gorffen gyda bwlch neu atalnod llawn.

source: The rule is applied to all items that has a specific value in its name.
cy: Bydd y rheol yma yn cael ei gweithredu ar bob eitem gyda gwerth penodol yn ei enw.

source: Auto-fixing of names ending with a space or full stop failed. See file {0} for details.
cy: Methwyd awto-trwsio enwau yn gorffen gyda bwlch neu atalnod llawn. Gwelwch ffeil {0} am manylion.

source: The Web Projects folder was successfully created: {0}
cy: Wedi creu'r ffolder 'Projectau Gwe' yn llwyddiannus: {0}

source: Property mismatch setting property ''{0}'' on constraint ''{1}''
cy: Anghydweddiad priodwedd yn gosod priodwedd "{0}" ar cyfyngiad "{1}"

source: Updated ACLs. Created {0} defining and {1} layered ACLs.
cy: Wedi diweddaru ACLs. Crëwyd {0} ACLs diffinio a {1} ACLs haenog.

source: The message has no 'to' address.
cy: Nid oes cyfeiriad 'i' gan y neges.

source: The operation {0} can not be applied to a text property.
cy: Ni ellir gweithredu'r gweithred {0} ar briodwedd testun.

source: Documentation
cy: Dogfennaeth

source: Changed {0} 'Guest' access control entries to 'Consumer'.
cy: Wedi newid {0} cofnod rheoli cyrchu 'Guest' i 'Consumer'.

source: The 'from' email address was not recognised: {0}.
cy: Ni adnabyddir cyfeiriad 'o' y neges e-bost: {0}.

source: Type
cy: Math

source: User managed definitions
cy: Diffiniadau defnyddiwr-rheolwyd

source: Path to the linked File
cy: Llwybr i'r ffeil cysylltiadol

source: Translatable
cy: Cyfieithiadwy

source: Forum
cy: Fforwm

source: Versionable
cy: Fersiwnadwy

source: The Person's last name
cy: Enw olaf y person

source: NodeRef of the deploymentattempt this deployment is part of.
cy: NodeRef o'r cais darpariaeth mae'r darpariaeth yma yn rhan o.

source: Check out content
cy: Gwirio allan cynnwys

source: Exception during evaluation of constraint ''{0}'': {1}
cy: Gwall wrth gwerthuso'r cyfyngiad '{0}'': {1}

source: AVM GUIDS set.
cy: Wedi gosod GUIDs AVM.

source: Migrating deployment data for web project ''{0}''
cy: Mudo data darpariaeth ar gyfer y project gwe "{0]"

source: Data Dictionary
cy: Geiriadur Data

source: Ensures the existence of the 'Email Templates' folder.
cy: Sicrhau bod y ffolder 'Templedi E-bost' y bodoli.

source: Deployment report for ''{0}'' from web project ''{1}'' has been migrated
cy: Wedi mudo adroddiad darpariaeth ar gyfer "{0}" tu fewn project gwe "{1}"

source: Email message handler was not found for node type ''{0}''.
cy: Ni chanfodwyd trinydd neges e-bost ar gyfer math nôd "{0}".

source: Bootstrap location already exists: {0}
cy: Mae'r lleoliad cychwyn y bodoli eisoes: {0}

source: This node is already checked out.
cy: Mae'r nôd yma wedi ei gwirio allan yn barod.

source: Items that have a specific aspect applied
cy: Eitemau gyda agwedd penodol wedi gosod

source: Module ''{0}'' version {1} is incompatible with the current repository version {2}. The repository version required must be in range [{3} : {4}].
cy: Mae modiwl "{0}" fersiwn {1} yn anghytun â'r fersiwn repositori presennol {2}. Rhaid i fersiwn y repositori bod yn yr amrediad [{3} : {4}].

source: Inline Editable
cy: Golygadwy Mewn-lein

source: Rights
cy: Hawliau

source: Owner
cy: Perchennog

source: Folder
cy: Plygell

source: Execute a JavaScript file to perform tasks such as creating new files or folders.
cy: Gweithredu ffeil JavaScript i berfformion tasgau fel creu ffeiliau neu ffolderau newydd.

source: The name of the store being reverted, only needed if flattening.
cy: Enw y stôr sy'n cael ei dychwelyd, angen yn unig os fyddwch yn lleddfu.

source: Creator
cy: Crëwr

source: The current implementation of the version service does not support the creation of branches.
cy: Nid yw gweithredoliant cyfredol y gwasanaeth fersiwn yn cynnal creu canghennau.

source: The collection of content routed through the workflow
cy: Casgliad o'r cynnwys sy'n mynd trwy'r llif gwaith

source: Web Content Forms
cy: Ffurflenni Cynnwys Gwe

source: Ensures the existence of the system workflow container.
cy: Sicrhau bod y cynhwysydd llifiau gwaith system yn bodoli.

source: The list of allowed values is empty
cy: Mae'r rhestr gwerthoedd a ganiateir yn gwag

source: Constraint ''{0}'' is part of a cyclic reference of constraints
cy: Mae'r cyfyngiad "{0}" yn rhan o cyfeirnod cylchol o cyfyngiadau

source: Store Identifier
cy: Dynodydd Stôr

source: Make a list of Nodes in a store transparent to staging.
cy: Gwneud rhestr o Nodau mewn stôr yn tryloyw i lwyfo.

source: Link to another File
cy: Cyswllt i Ffeil arall

source: An error occurred whilst generating the directory listing, please contact the system administrator.
cy: Digwyddodd gwall wrth cynhyrchu'r rhestr cyfeiriadur, cysylltwch â'ch gweinyddwr system, os gwelwch yn dda.

source: The node''s content is missing: node: {0} reader: {1} Please contact your system administrator.
cy: Mae cynnwys y nôd ar goll: nôd: {0} darllenwr: {1} Cysylltwch â'ch gweinyddwr system, os gwelwch yn dda.

source: Root
cy: Gwraidd

source: Store Protocol
cy: Protocol Stôr

source: Decision made on completing Task
cy: Penderfyniad bydd yn cael ei wneud pan fo'r tasg yn cael ei cwblhau

source: Failed to read the message part content: {0}
cy: Methwyd darllen y cynnwys rhan neges: {0}

source: Schema managed by database dialect {0}.
cy: Sgema wedi'i rheoli gan dafodiaeth cronfa ddata {0}.

source: Working copy node ({0}) has no mimetype
cy: Nid oes gan nôd y copi gweithio ({0}) math MIME

source: Added guest user and fixed permissions.
cy: Werdi ychwanegu'r defnyddiwr gwestai a thrwsio caniatadau.

source: Executing statement: {0}
cy: Gweithredu datganiad: {0}

source: The AVM Node Descriptor of the version to revert to.
cy: Y Disgrifiwr Nôd AVM o'r fersiwn i dychwelyd i.

source: Deployment data has been migrated.
cy: Wedi mudo data darpariaeth.

source: Localizable
cy: Lleoladwy

source: Numeric value ''{0}'' is not in range [{1}; {2}]
cy: Nid yw'r gwerth rhifol "{0}" yn yr ystod [{1}; {2}]

source: Determines whether the link check should use the corresponding staging area for comparison
cy: Penodi os ddylai'r gwiriad cysylltiadau defnyddio'r ardal llwyfo sy'n cyfateb ar gyfer cymharu

source: A connection to OpenOffice could not be established.
cy: Methwyd creu cysylltiad i OpenOffice.

source: The version.properties resource could not be found.
cy: Methu canfod yr adnodd version.properties.

source: Percent Complete
cy: Canran Cyflawn

source: The specified property is not a content type so mime type can not be compared.
cy: Nid yw'r priodwedd penodol yn math cynnwys a felly ni ellir cymharu'r math MIME.

source: The Email Contributor Group doesn't exist.
cy: Nid yw'r Grŵp Cyfrannwr E-bost yn bodoli.

source: Reindexed usr:authorityContainer with identifiers
cy: Wedi ail-fynegeio usr:authorityContainer gyda dynodyddion

source: E-mail Address
cy: Cyfeiriad E-bost

source: Initial Version
cy: Fersiwn Gwreiddiol

source: Check in content
cy: Gwirio i fewn cynnwys

source: Failed to create anonymous type as specified aspect {0} not found
cy: Methwyd creu'r math dienw gan fod yr agwedd {0} penodol heb ei canfod

source: Saved Query
cy: Ymholiad a Gadwyd

source: Value ''{0}'' matches regular expression: {1}
cy: Mae'r gwerth "{0}" yn cydweddu â'r mynegiad rheolaidd: {1}

source: Archived By
cy: Wedi Archifio gan

source: Space containing forums
cy: Lle sy'n cynnwys fforymau

source: (Working Copy)
cy: (Copi Gweithio)

source: Value ''{0}'' does not match regular expression: {1}
cy: Nid yw'r gwerth "{0}" yn cydweddu â'r mynegiad rheolaidd: {1}

source: References
cy: Cyfeiriadau

source: Workflow Assignees
cy: Aseineion Llif Gwaith

source: Simple Direct Submit
cy: Cyflwyniad Uniongyrchol Syml

source: Software Engineering Project
cy: Project Peirianneg Meddalwedd

source: Adds Web Scripts (second set) to Data Dictionary.
cy: Ychwanegu Sgriptiau Gwe (ail set) i'r Geiriadur Data.

source: Discussion
cy: Trafodaeth

source: Imports title, author and description metadata fields from common content types.
cy: Mewnforio meysydd metadata teitl, awdur a disgrifiad o'r mathau cynnwys cyffredin.

source: Forum Model
cy: Model Fforwm

source: This will add an aspect to the matched item.
cy: Bydd hwn yn ychwanegu agwedd i'r eitem sy'n cydweddu.

source: === Failed to apply patch === ID: {0} RESULT: {1} =====================================
cy: === Wedi methu gosod gywiriad === ID: {0} CANLYNIAD: {1} =====================================

source: The message has no 'from' address.
cy: Nid oes cyfeiriad 'o' gan y neges.

source: This will transform the the matched content and copy the result to a specific space
cy: Bydd hwn yn transffufio'r cynnwys sy'n cydweddu a chopïo'r canlyniad i le penodol

source: Migrates deployment data to the new model.
cy: Mudo data darpariaeth i'r model newydd.

source: Saved Searches
cy: Chwiliadau a Chadwyd

source: Task
cy: Tasg

source: Can not perform operation since the node (id:{0}) is locked.
cy: Methu perfformio'r gweithrediad gan fod y nôd (id:{0}) wedi'i cloi.

source: Addressee
cy: Cyfeirydd

source: The scripts folder was successfully created: {0}
cy: Wedi creu'r ffolder 'Sgriptiau' yn llwyddiannus: {0}

source: Reject Folder
cy: Ffolder Gwrthod

source: The current version label of the node does not exist in the version history.
cy: Nid yw label fersiwn presennol y nôd yn bodoli yn yr hanes fersiwn.

source: Workflow Group Assignee
cy: Aseinai Grŵp Llif Gwaith

source: Bootstraps the node that will hold the multilingual containers.
cy: Ychwanegu'r nôd bydd yn dal y cynwysyddion amlieithog.

source: Downgrading of modules is not supported. Module ''{0}'' version {1} is currently installed and must be uninstalled before version {2} can be installed.
cy: Ni chynhelir israddio modiwlau. Mae modiwl "{0}" fersiwn {1} wedi'i gosod eisoes a rhaid dadosod cyn gosod fersiwn {2}.

source: Double
cy: Dwbl

source: Base
cy: Sail

source: Summarizable
cy: Crynhoiadwy

source: Reindex usr:authorityContainer gids as identifiers
cy: Ail-fynegeio gids usr:authorityContainer fel dynodyddion

source: Unique Identifier
cy: Dynodydd Unigryw

source: Workflow Instance Id
cy: Dynodydd Enghraifft Llif Gwaith

source: Archived Date
cy: Dyddiad Archifio

source: The module component has already been executed: {0}.{1}
cy: Mae'r cydran modiwl wedi ei gweithredu eisoes: {0}.{1}

source: Basable
cy: Seiladwy

source: This will move the matched item to another space.
cy: Bydd hwn yn symud yr eitem sy'n cydweddu i le arall.

source: User Name
cy: Enw Defnyddiwr

source: Reindexed wca:webfolder to make wca:avmstore an identifier
cy: Wedi ail-fynegeio wca:webfolder i wneud wca:avmstore yn dynodydd

source: Execute a script
cy: Gweithredu sgript

source: Required authority path not found: {0}
cy: Methwyd canfod llwybr awdurdod angenrheidiol: {0}

source: Effectivity
cy: Effeithiadwy

source: Topic
cy: Pwnc

source: Fixed {0} top level groups child association types.
cy: Wedi trwsio {0} mathau cysylltiad plentyn grwpiau lefel-uchaf.

source: Completion Date
cy: Dyddiad Cwblhau

source: Applied ReadMe template to Web Scripts folders
cy: Wedi gosod templedi ReadMe i ffolderau Sgriptiau Gwe

source: Execute all rules
cy: Gweithredu pob rheol

source: The user ''{0}'' in not in the email contributor group.
cy: Nid yw'r defnyddiwr "{0}" yn y grŵp cyfrannwr e-bost

source: Alfresco System Model
cy: Model System Alfresco

source: The subject line must be a valid file name.
cy: Rhaid i'r llinell testun bod yn enw ffeil dilys.

source: Migrate existing rules to the updated model where rules are decoupled from actions.
cy: Mudo rheolau presennol i'r model wedi'i diweddaru lle bydd rheolau wedi'i gwahanu o gweithredion.

source: Workflow
cy: Llif Gwaith

source: Subject
cy: Pwnc

source: IO Error during processing of the template ''{0}''. Please contact your system administrator.
cy: Gwall IO wrth prosesu'r templed "{0}". Cysylltwch â'ch gweinyddwr system, os gwelwch yn dda.

source: Link item to category
cy: Cysylltu eitem i gategori

source: Found {0} module(s).
cy: Canfodwyd {0} modiwlau.

source: Move or Copy
cy: Symud neu Copïo

source: Revert a List of Nodes in a store.
cy: Dychwelyd Rhestr o Nodau tu fewn stôr.

source: Title
cy: Teitl

source: The property ''errorCodes'' has moved down onto the RuntimeExec class
cy: Mae'r priodwedd "errorCodes" wedi symud i lawr i'r dosbarth RuntimeExec

source: Ensure top level groups have the correct child association type.
cy: Sicrhau bod y math cysylltiad plentyn cywir gan y grwpiau lefel-uchaf.

source: Starting module ''{0}'' version {1}.
cy: Cychwyn modiwl "{0}" fersiwn {1}.

source: Deep Lock
cy: Clo Dwfn

source: Property ''{0}'' has not been set on constraint ''{1}''
cy: Nid yw priodwedd "{0}" wedi ei gosod ar y cyfyngiad "{1}"

source: Who created this item
cy: Pwy crëwyd yr eitem yma

source: Attached repository objects
cy: Gwthrychau repositori atodedig

source: This will specialise the matched item to a given type.
cy: Bydd hwn yn arbenigo yr eitem sy'n cydweddu i fath penodol.

source: All executed statements written to file {0}.
cy: Ysgrifennwyd pob datganiad a gweithredwyd i ffeil {0}.

source: Adds Web Scripts Extension to Data Dictionary.
cy: Ychwanegu Estyniad Sgriptiau Gwe i'r Geiriadur Data.

source: Workflow Task
cy: Tasg Llif Gwaith

source: {0} discussion
cy: Trafodaeth {0}

source: The Alfresco ''dir.root'' property is set to a relative path ''{0}''. ''dir.root'' should be overridden to point to a specific folder.
cy: Mae'r priodwedd Alfresco "dir.root" wedi'i gosod i lwybr perthnasol "{0}". Dylai gwthwneud "dir.root" i bwyntio i ffolder penodol.

source: Pooled Users
cy: Defnyddwyr yn y Pwll

source: Cannot relax mandatory attribute of property ''{0}
cy: Methu ymlacio priodoledd angenrheidiol y priodwedd "{0}"

source: Scripts
cy: Sgriptiau

source: The DeploymentCallback listener object.
cy: Y gwrthrych gwrando DeploymentCallback.

source: This promotes any newer nodes in the matched item to the specified target sandbox.
cy: Mae hwn yn dyrchafu unrhyw nodau mwy newydd mewn yr eitem sy'n cydweddu i'r blwch tywod llwyfo penodol.

source: Lock Owner
cy: Perchennog Clo

source: Unable to connect to remote Alfresco server via HTTP: {0}
cy: Methu cysylltu â'r gweinydd pell Alfresco dros HTTP: {0}

source: Formats
cy: Fformatau

source: Created system workflow container {0}.
cy: Wedi creu y cynhwysydd llifiau gwaith system {0}.

source: Ensures the existence of the user authorities folder [JIRA: AR-497].
cy: Sicrhau bod y ffolder awdurdodau defnyddiwr yn bodoli [JIRA: AR-497].

source: Workflow Definition Id
cy: Dynodydd Diffiniad Llif Gwaith

source: Step by step guide to the Alfresco application
cy: Arweiniad cam wrth cam i'r cymhwysiad Alfresco

source: alfresco/messages/workflow-interpreter-help.txt
cy: alfresco/messages/workflow-interpreter-help_cy_CY.txt

source: The connection to OpenOffice has been established.
cy: Wedi creu'r cysylltiad i OpenOffice.

source: An unrecognized error occured when attempting to download content from remote server: Server: {0} Content: {1} HTTP Response: {2}
cy: Digwyddodd gwall anhysbys wrth lawrlwytho cynnys o weinydd pell: Gweinydd: {0} Cynnwys: {1} Ymateb HTTP. {2}

source: UI Facets
cy: Nodweddion UI

source: Transform and copy image to a specific space
cy: Trawsffurfio a chopïo delwedd i le penodol

source: String length of ''{0}'' is not in range [{1}; {2}]
cy: Nid yw hyd y llinyn o "{0}" yn yr ystod [{1}; {2}]

source: Invalid 'minValue' property: {0}
cy: Priodwedd 'minValue' annilys: {0}

source: Emailed
cy: E-bostiwyd

source: Pool
cy: Pwll

source: Updates forums icon references
cy: Diweddaru cyfeirnodau eiconau fforwm

source: You may set 'index.recovery.mode=FULL' if you need to rebuild the indexes.
cy: Medrwch gosod 'index.recovery.mode=FULL' os bydd rhaid i chi ailadeiladu'r mynegion.

source: Folder for containing system-level items
cy: Plygell sy'n cynnwys eitemau lefel-system

source: Replaces
cy: Amnewid

source: Alfresco should not be used with database dialect {0}.
cy: Ni ddylid defnyddio Alfresco gyda'r dafodiaeth cronfa ddata {0}.

source: Marker patch applied
cy: Wedi gosod cywiriad marciwr

source: Alfresco-Tutorial.pdf
cy: Tiwtorial-Alfresco.pdf

source: Countable
cy: Cyfrifadwy

source: Patch property ''{0}'' has not been set on this patch: {1}
cy: Nid yw priodwedd cywiriad "{0}" wedi osod ar y cywiriad yma: {1}

source: Outbound
cy: Anfonedig

source: Subscribed By
cy: Tanysgrifiwyd Gan

source: Invalid 'maxValue' property: {0}
cy: Priodwedd 'maxValue' annilys: {0}

source: CONTENT INTEGRITY ERROR: Indexes not found for {0} stores.
cy: GWALL CYFANRWYDD CYNNWYS: Heb ganfod mynegion ar gyfer {0} storau.

source: Items of a specified type or its sub-types
cy: Eitemau o math penodol neu ei is-mathau

source: Version Label
cy: Label Fersiwn

source: Web Projects
cy: Projectau Gwe

source: Alfresco Repository export.
cy: Allforyn Repositori Alfresco

source: Workflow Group Assignees
cy: Aseineion Grŵp Llif Gwaith

source: Store name for start task
cy: Enw stôr ar gyfer cychwyn tasg

source: Archived Node
cy: Nôd wedi'i Archifo

source: Deploy a website to a remote server.
cy: Darparu safle gwe i weinydd pell.

source: Rename guest permission from 'Guest' to 'Consumer'
cy: Ail-enwi caniatâd gwestai o 'Guest' i 'Consumer'

source: Change Guest Person permission to visible by all users as 'Consumer'.
cy: Newid caniatâd y Person Gwestai i fod yn gweledig i bob defnyddiwr fel 'Consumer'.

source: Update
cy: Diweddaru

source: Forum Article
cy: Erthygl Fforwm

source: A previous schema upgrade failed. Revert to the original database before attempting the upgrade again.
cy: Methwyd uwchraddiad sgema blaenorol. Dychwelwch i'r cronfa ddata gweiddiol cyn ceisio'r uwchraddiad eto.

source: The name of the WCM workflow to invoke.
cy: Enw y llif gwaith WCM i ddefnyddio.

source: Property type of property ''{0}'' must be specified
cy: Rhaid penodi math priodwedd o'r briodwedd "{0}"

source: Scripts must terminate all statements with ';' (line {0} of {1}).
cy: Rhaid i sgriptiau terfynu pob datganiad gyda ';' (llinell {0} o {1}).

source: Deployed ReadMe Template
cy: Wedi darparu templed ReadMe

source: Effective From
cy: Effeithiol o

source: Invalid 'maxLength' property: {0}
cy: Priodwedd 'maxLength' annilys: {0}

source: Alfresco is using the HSQL default database. Please only use this while evaluating Alfresco, it is NOT recommended for production or deployment!
cy: Mae Alfresco yn defnyddio'r cronfa ddata rhagosodedig HSQL. Os gwelwch yn dda defnyddiwch hwn i wethuso Alfresco, ni argymhellir fe ar gyfer systemau cynhyrchol neu lleoli!

source: Updated {0} rules.
cy: Wedi diweddaru {0} rheolau.

source: Changes storage of properties on AVM Nodes.
cy: Newid storfa o priodweddau ar nodau AVM.

source: Update permission entries from 'cm:content' to 'sys:base'.
cy: Diweddaru cofnodau caniatâd o 'cm:content' i 'sys:base'.

source: Updated Guest Person permission from 'Consumer' to 'Read'
cy: Wedi newid caniatâd y Person Gwestai o 'Consumer' i 'Read'

source: Schema auto-update failed
cy: Methwyd awtoddiweddariad sgema.

source: File Link
cy: Cyswllt Ffeil

source: The name of the staging store to flatten to.
cy: Enw y stôr llwyfo i leddfu i.

source: 'Saved Searches' folder could not be found.
cy: Methu canfod y ffolder 'Chwiliadau a Chadwyd'.

source: Company Home
cy: Cwmni Cartref

source: Sets required permissions on 'Category Root' folder.
cy: Gosod caniatadau angenrheidiol ar y ffolder 'Gwraidd Categori'.

source: Basis
cy: Sail

source: Description
cy: Disgrifiad

source: Task Done
cy: Tasg Wedi'i Wneud

source: Space containing forum articles (posts)
cy: Lle sy'n cynnwys erthyglau fforwm (postiau)

source: The saved searches folder was successfully created: {0}
cy: Wedi creu'r ffolder 'Chwiliadau a Chadwyd' yn llwyddiannus: {0}

source: Status
cy: Statws

source: Category
cy: Categori

source: Module ''{0}'' version {1} depends on module ''{2}'', which has not been installed.
cy: Mae modiwl "{0}" fersiwn {1} yn dibynnu ar modiwl "{2}", sydd ddim wedi ei gosod.

source: Failed to create anonymous type as specified type {0} not found
cy: Methwyd creu'r math dienw gan fod y math {0} penodol heb ei canfod

source: The operation {0} can not be applied a property of type {1}.
cy: Ni ellir gweithredu'r gweithred {0} ar briodwedd o fath {1}.

source: The rule is applied to all items that have content of the specified mime type.
cy: Bydd y rheol yma yn cael ei gweithredu ar bob eitem sydd gyda cynnwys o'r math MIME penodol.

source: Reindexed wca:webform to make wca:formname an identifier
cy: Wedi ail-fynegeio wca:webform i wneud wca:formname yn dynodydd

source: Integer
cy: Cyfanrif

source: Task assigned by a Workflow
cy: Tasg wedi'i neilltuo gan Llif Gwaith

source: Starts a workflow expecting an AVM workflow package
cy: Cychwyn llif gwaith gan ddisgwyl pecyn llif gwaith AVM

source: The Alfresco server is not configured to accept inbound emails.
cy: Nid yw'r gweinydd Alfresco wedi'i ffurfweddu i dderbyn negesuon e-bost i fewn.

source: System Overview
cy: Trosolwg System

source: Add aspect to item
cy: Ychwanegu agwedd i eitem

source: Modifier
cy: Newidiwr

source: Node Identifier
cy: Dynodydd Nôd

source: Web Content Management Spaces
cy: Lleoedd Rheolaeth Cynnwys Gwe

source: Middle Name
cy: Enw Canol

source: Error during processing of the template ''{0}''. Please contact your system administrator.
cy: Gwall wrth prosesu'r templed "{0}". Cysylltwch â'ch gweinyddwr system, os gwelwch yn dda.

source: Effective To
cy: Effeithiol i

source: Referencing
cy: Cyfeirio

source: Space Templates
cy: Templedi Lle

source: This will set the value of a property to a given value.
cy: Bydd hwn yn gosod gwerth priodwedd i werth penodol.

source: Extract common metadata fields from content
cy: Echdynnu meysydd metadata cyffredin o gynnwys

source: Date
cy: Dyddiad

source: Drafts
cy: Draftiau

source: The store relative path that should be flattened.
cy: Y llwybr stôr-perthnasol y ddylai lleddfu.

source: === Recorded patch (not executed) === ID: {0} RESULT: {1} =====================================
cy: === Gywiriad wedi'i recordio === ID: {0} CANLYNIAD: {1} =====================================

source: Granted CONSUMER role to GUEST on 'Category Root' folder: {0}.
cy: Wedi addef rôl DARLLENWR i GWESTAI ar y ffolder 'Gwraidd Categori': {0}.

source: Updated Guest Person permission to visible by all users as 'Consumer'.
cy: Wedi newid caniatâd y Person Gwestai i fod yn gweledig i bob defnyddiwr fel 'Consumer'.

source: Revert a Node to a particular version.
cy: Dychwelyd Nôd i fersiwn dewisiedig.

source: Parts
cy: Rhannau

source: Long
cy: Hir

source: Executing database script {0} (Copied from {1}).
cy: Gweithredu sgript cronfa ddata {0} (Wedi'i copïo o {1})
